cask_args appdir: '/Applications'

# Taps
tap 'homebrew/core'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/services'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'
brew 'bash'
brew 'bash-completion2'

# Install GNU core utilities (those that come with macOS are outdated)
# add $(brew --prefix coreutils)/libexec/gnubin to $PATH
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'gnu-sed'
brew 'gnupg'
brew 'ack'
brew 'jq'
brew 'readline'
#brew 'spaceman-diff'
#brew 'spark'
brew 'unrar'
brew 'wget', args: ['with-iri']
#brew 'yarn'
brew 'youtube-dl'
#brew 'roundup'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'trash'
brew 'openssh'
brew 'zopfli'
brew 'aria2'
brew 'cmake'
brew 'cowsay'
brew 'editorconfig'
brew 'hub'
brew 'irssi'
brew 'kakoune', args: ['HEAD']
brew 'imagemagick', args: ['with-webp']
brew 'liquidprompt'
brew 'python3'
brew 'ncurses'
brew 'neovim'
brew 'the_silver_searcher'
brew 'tmux'
brew 'vim', args: ['with-override-system-vi']
brew 'lynx'
brew 'elinks'
brew 'rename'
brew 'nmap'
brew 'binutils'

# Apps
#cask 'aerial'
#cask 'alfred'
cask 'caffeine'
cask 'docker'
#cask 'dropbox'
#cask 'google-backup-and-sync'
cask 'gpgtools'
cask 'mysqlworkbench'
#cask 'quip'
#cask 'shuttle'
cask 'steam'
#cask 'torbrowser'
cask 'transmission'
#cask 'transmit'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'limechat'
cask 'licecap'
cask 'screenflow'
cask 'disk-inventory-x'
cask 'firefoxnightly'
cask 'beyond-compare'
cask 'colloquy'
cask 'emacs'
cask 'firefox'
cask 'macvim'
cask 'google-chrome'
cask 'iterm2'
cask 'onedrive'
cask 'psequel'
cask 'sequel-pro'
cask 'slack'
cask 'sublime-text'
cask 'unetbootin'
cask 'visual-studio-code'
cask 'zoomus'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'
